result_4082XC226449.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;84733;82;12375;340;28836;12033.229024;1577.883736;24422;132017;84314.089844;4678.725448;1.000000%=74973;5.000000%=82313;10.000000%=82313;20.000000%=82313;30.000000%=83361;40.000000%=84410;50.000000%=84410;60.000000%=84410;70.000000%=84410;80.000000%=85458;90.000000%=85458;95.000000%=86507;99.000000%=98041;99.500000%=111673;99.900000%=129499;99.950000%=131596;99.990000%=131596;0%=0;0%=0;0%=0;36460;148717;96350.728420;4934.101811;66782;88064;99.804189%;84567.083333;3960.053227;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.492969%;1.090997%;1030;0;2059;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;98.73%;0.98%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;76337;74;13736;30;274617;13375.443046;12038.917208;12033;492582;91850.428585;34294.046518;1.000000%=81264;5.000000%=83361;10.000000%=83361;20.000000%=83361;30.000000%=83361;40.000000%=83361;50.000000%=84410;60.000000%=84410;70.000000%=88604;80.000000%=98041;90.000000%=103284;95.000000%=105381;99.000000%=206569;99.500000%=358612;99.900000%=492830;99.950000%=492830;99.990000%=492830;0%=0;0%=0;0%=0;24170;504703;105228.918470;39147.384182;4047;84136;99.511959%;75964.444444;18850.551992;1.004732%;1.237714%;1044;0;12;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.20%;83.59%;15.23%;0.88%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Seq1M-Read;2;0;1048576;83778;81;12516;99;558;165.678574;21.181694;11610;27358;12038.239475;644.323615;1.000000%=11730;5.000000%=11862;10.000000%=11862;20.000000%=11993;30.000000%=11993;40.000000%=11993;50.000000%=11993;60.000000%=11993;70.000000%=11993;80.000000%=11993;90.000000%=11993;95.000000%=12124;99.000000%=13828;99.500000%=15007;99.900000%=19267;99.950000%=27394;99.990000%=27394;0%=0;0%=0;0%=0;11764;27537;12205.550235;645.131087;78877;86188;100.000000%;83974.375000;1568.964788;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.159808%;1.821814%;1041;0;268;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;99.90%;0.10%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;78592;76;13342;154;411;248.811876;33.860422;11733;46972;12762.298623;3333.562247;1.000000%=11862;5.000000%=11993;10.000000%=11993;20.000000%=11993;30.000000%=12124;40.000000%=12124;50.000000%=12124;60.000000%=12124;70.000000%=12124;80.000000%=12124;90.000000%=12124;95.000000%=15532;99.000000%=31850;99.500000%=32636;99.900000%=35389;99.950000%=46923;99.990000%=46923;0%=0;0%=0;0%=0;11930;47224;13012.801884;3331.912470;75776;82084;100.000000%;78756.769231;1772.551930;1.146841%;1.356720%;1042;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;96.48%;3.52%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Rand-Read-4K-Q32;4;0;587376;9789;2447;60002;5;2121;403.189614;23.874369;832;15178;12667.823744;237.458142;1.000000%=12255;5.000000%=12386;10.000000%=12386;20.000000%=12517;30.000000%=12517;40.000000%=12648;50.000000%=12648;60.000000%=12648;70.000000%=12779;80.000000%=12910;90.000000%=12910;95.000000%=13041;99.000000%=13434;99.500000%=13697;99.900000%=14090;99.950000%=14221;99.990000%=14483;0%=0;0%=0;0%=0;1246;15592;13071.797308;242.484571;9579;9963;100.000000%;9798.033613;110.882969;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.686639%;4.671589%;146857;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;99.98%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;170884;2847;711;60002;38;26664;1387.603820;1230.061733;1235;87759;43533.034582;5618.945379;1.000000%=38010;5.000000%=39059;10.000000%=40108;20.000000%=41156;30.000000%=42205;40.000000%=42729;50.000000%=42729;60.000000%=43253;70.000000%=43778;80.000000%=44302;90.000000%=45350;95.000000%=46923;99.000000%=78118;99.500000%=80216;99.900000%=82313;99.950000%=84410;99.990000%=87556;0%=0;0%=0;0%=0;2212;88803;44922.550388;5695.125144;2584;3070;100.000000%;2849.277311;102.846926;1.389977%;4.671589%;42788;0;12;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.02%;97.17%;2.80%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Rand-Read-4K;6;0;353244;5887;1471;60001;9;1770;48.859464;16.558249;5;2346;619.368232;50.858948;1.000000%=468;5.000000%=518;10.000000%=544;20.000000%=602;30.000000%=610;40.000000%=618;50.000000%=626;60.000000%=643;70.000000%=651;80.000000%=651;90.000000%=659;95.000000%=667;99.000000%=716;99.500000%=724;99.900000%=823;99.950000%=995;99.990000%=1286;0%=0;0%=0;0%=0;384;2419;669.146608;54.474378;5808;6893;100.000000%;5893.000000;101.425517;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3.290000%;10.938333%;88372;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;2.42%;97.39%;0.14%;0.05%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;160420;2673;668;60001;8;331;56.424217;3.508798;797;26865;1426.719507;1240.485326;1.000000%=946;5.000000%=970;10.000000%=995;20.000000%=1056;30.000000%=1056;40.000000%=1073;50.000000%=1073;60.000000%=1089;70.000000%=1089;80.000000%=1122;90.000000%=1417;95.000000%=4292;99.000000%=5341;99.500000%=5406;99.900000%=15794;99.950000%=22413;99.990000%=24510;0%=0;0%=0;0%=0;908;26923;1484.184199;1240.464034;2396;2840;100.000000%;2676.689076;96.577075;2.125000%;5.236667%;40155;0;11;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;10.60%;80.14%;0.11%;8.99%;0.09%;0.07%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;237431;84741;2;0;203168;136492;339661;99.46%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=7016: Wed Jul 31 08:46:21 2024
  read: IOPS=82, BW=82.7MiB/s (86.8MB/s)(1024MiB/12375msec)
    slat (usec): min=340, max=28836, avg=12033.23, stdev=1577.88
    clat (msec): min=24, max=132, avg=84.31, stdev= 4.68
     lat (msec): min=36, max=148, avg=96.35, stdev= 4.93
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   83], 10.00th=[   83], 20.00th=[   83],
     | 30.00th=[   84], 40.00th=[   85], 50.00th=[   85], 60.00th=[   85],
     | 70.00th=[   85], 80.00th=[   86], 90.00th=[   86], 95.00th=[   87],
     | 99.00th=[   99], 99.50th=[  112], 99.90th=[  130], 99.95th=[  132],
     | 99.99th=[  132]
   bw (  KiB/s): min=66782, max=88064, per=99.80%, avg=84567.08, stdev=3960.05, samples=24
   iops        : min=   65, max=   86, avg=82.46, stdev= 3.89, samples=24
  lat (msec)   : 50=0.29%, 100=98.73%, 250=0.98%
  cpu          : usr=0.49%, sys=1.09%, ctx=1030, majf=0, minf=2059
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=7019: Wed Jul 31 08:46:21 2024
  write: IOPS=74, BW=74.5MiB/s (78.2MB/s)(1024MiB/13736msec); 0 zone resets
    slat (usec): min=30, max=274617, avg=13375.44, stdev=12038.92
    clat (msec): min=12, max=492, avg=91.85, stdev=34.29
     lat (msec): min=24, max=504, avg=105.23, stdev=39.15
    clat percentiles (msec):
     |  1.00th=[   82],  5.00th=[   84], 10.00th=[   84], 20.00th=[   84],
     | 30.00th=[   84], 40.00th=[   84], 50.00th=[   85], 60.00th=[   85],
     | 70.00th=[   89], 80.00th=[   99], 90.00th=[  104], 95.00th=[  106],
     | 99.00th=[  207], 99.50th=[  359], 99.90th=[  493], 99.95th=[  493],
     | 99.99th=[  493]
   bw (  KiB/s): min= 4047, max=84136, per=99.51%, avg=75964.44, stdev=18850.55, samples=27
   iops        : min=    3, max=   82, avg=74.04, stdev=18.52, samples=27
  lat (msec)   : 20=0.10%, 50=0.20%, 100=83.59%, 250=15.23%, 500=0.88%
  cpu          : usr=1.00%, sys=1.24%, ctx=1044, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=7023: Wed Jul 31 08:46:21 2024
  read: IOPS=81, BW=81.8MiB/s (85.8MB/s)(1024MiB/12516msec)
    slat (usec): min=99, max=558, avg=165.68, stdev=21.18
    clat (usec): min=11610, max=27358, avg=12038.24, stdev=644.32
     lat (usec): min=11764, max=27537, avg=12205.55, stdev=645.13
    clat percentiles (usec):
     |  1.00th=[11731],  5.00th=[11863], 10.00th=[11863], 20.00th=[11994],
     | 30.00th=[11994], 40.00th=[11994], 50.00th=[11994], 60.00th=[11994],
     | 70.00th=[11994], 80.00th=[11994], 90.00th=[11994], 95.00th=[12125],
     | 99.00th=[13829], 99.50th=[15008], 99.90th=[19268], 99.95th=[27395],
     | 99.99th=[27395]
   bw (  KiB/s): min=78877, max=86188, per=100.00%, avg=83974.38, stdev=1568.96, samples=24
   iops        : min=   77, max=   84, avg=81.88, stdev= 1.51, samples=24
  lat (msec)   : 20=99.90%, 50=0.10%
  cpu          : usr=0.16%, sys=1.82%, ctx=1041, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=7024: Wed Jul 31 08:46:21 2024
  write: IOPS=76, BW=76.8MiB/s (80.5MB/s)(1024MiB/13342msec); 0 zone resets
    slat (usec): min=154, max=411, avg=248.81, stdev=33.86
    clat (usec): min=11733, max=46972, avg=12762.30, stdev=3333.56
     lat (usec): min=11930, max=47224, avg=13012.80, stdev=3331.91
    clat percentiles (usec):
     |  1.00th=[11863],  5.00th=[11994], 10.00th=[11994], 20.00th=[11994],
     | 30.00th=[12125], 40.00th=[12125], 50.00th=[12125], 60.00th=[12125],
     | 70.00th=[12125], 80.00th=[12125], 90.00th=[12125], 95.00th=[15533],
     | 99.00th=[31851], 99.50th=[32637], 99.90th=[35390], 99.95th=[46924],
     | 99.99th=[46924]
   bw (  KiB/s): min=75776, max=82084, per=100.00%, avg=78756.77, stdev=1772.55, samples=26
   iops        : min=   74, max=   80, avg=76.77, stdev= 1.70, samples=26
  lat (msec)   : 20=96.48%, 50=3.52%
  cpu          : usr=1.15%, sys=1.36%, ctx=1042, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=7028: Wed Jul 31 08:46:21 2024
  read: IOPS=2447, BW=9789KiB/s (10.0MB/s)(574MiB/60002msec)
    slat (usec): min=5, max=2121, avg=403.19, stdev=23.87
    clat (usec): min=832, max=15178, avg=12667.82, stdev=237.46
     lat (usec): min=1246, max=15592, avg=13071.80, stdev=242.48
    clat percentiles (usec):
     |  1.00th=[12256],  5.00th=[12387], 10.00th=[12387], 20.00th=[12518],
     | 30.00th=[12518], 40.00th=[12649], 50.00th=[12649], 60.00th=[12649],
     | 70.00th=[12780], 80.00th=[12911], 90.00th=[12911], 95.00th=[13042],
     | 99.00th=[13435], 99.50th=[13698], 99.90th=[14091], 99.95th=[14222],
     | 99.99th=[14484]
   bw (  KiB/s): min= 9579, max= 9963, per=100.00%, avg=9798.03, stdev=110.88, samples=119
   iops        : min= 2394, max= 2490, avg=2449.14, stdev=27.72, samples=119
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.98%
  cpu          : usr=1.69%, sys=4.67%, ctx=146857, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=146844,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=7029: Wed Jul 31 08:46:21 2024
  write: IOPS=711, BW=2848KiB/s (2916kB/s)(167MiB/60002msec); 0 zone resets
    slat (usec): min=38, max=26664, avg=1387.60, stdev=1230.06
    clat (usec): min=1235, max=87759, avg=43533.03, stdev=5618.95
     lat (usec): min=2212, max=88803, avg=44922.55, stdev=5695.13
    clat percentiles (usec):
     |  1.00th=[38011],  5.00th=[39060], 10.00th=[40109], 20.00th=[41157],
     | 30.00th=[42206], 40.00th=[42730], 50.00th=[42730], 60.00th=[43254],
     | 70.00th=[43779], 80.00th=[44303], 90.00th=[45351], 95.00th=[46924],
     | 99.00th=[78119], 99.50th=[80217], 99.90th=[82314], 99.95th=[84411],
     | 99.99th=[87557]
   bw (  KiB/s): min= 2584, max= 3070, per=100.00%, avg=2849.28, stdev=102.85, samples=119
   iops        : min=  646, max=  767, avg=712.19, stdev=25.71, samples=119
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=97.17%
  lat (msec)   : 100=2.80%
  cpu          : usr=1.39%, sys=4.67%, ctx=42788, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,42721,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=7035: Wed Jul 31 08:46:21 2024
  read: IOPS=1471, BW=5887KiB/s (6029kB/s)(345MiB/60001msec)
    slat (usec): min=9, max=1770, avg=48.86, stdev=16.56
    clat (usec): min=5, max=2346, avg=619.37, stdev=50.86
     lat (usec): min=384, max=2419, avg=669.15, stdev=54.47
    clat percentiles (usec):
     |  1.00th=[  469],  5.00th=[  519], 10.00th=[  545], 20.00th=[  603],
     | 30.00th=[  611], 40.00th=[  619], 50.00th=[  627], 60.00th=[  644],
     | 70.00th=[  652], 80.00th=[  652], 90.00th=[  660], 95.00th=[  668],
     | 99.00th=[  717], 99.50th=[  725], 99.90th=[  824], 99.95th=[  996],
     | 99.99th=[ 1287]
   bw (  KiB/s): min= 5808, max= 6893, per=100.00%, avg=5893.00, stdev=101.43, samples=119
   iops        : min= 1452, max= 1723, avg=1472.87, stdev=25.39, samples=119
  lat (usec)   : 10=0.01%, 500=2.42%, 750=97.39%, 1000=0.14%
  lat (msec)   : 2=0.05%, 4=0.01%
  cpu          : usr=3.29%, sys=10.94%, ctx=88372, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=88311,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=7036: Wed Jul 31 08:46:21 2024
  write: IOPS=668, BW=2674KiB/s (2738kB/s)(157MiB/60001msec); 0 zone resets
    slat (usec): min=8, max=331, avg=56.42, stdev= 3.51
    clat (usec): min=797, max=26865, avg=1426.72, stdev=1240.49
     lat (usec): min=908, max=26923, avg=1484.18, stdev=1240.46
    clat percentiles (usec):
     |  1.00th=[  947],  5.00th=[  971], 10.00th=[  996], 20.00th=[ 1057],
     | 30.00th=[ 1057], 40.00th=[ 1074], 50.00th=[ 1074], 60.00th=[ 1090],
     | 70.00th=[ 1090], 80.00th=[ 1123], 90.00th=[ 1418], 95.00th=[ 4293],
     | 99.00th=[ 5342], 99.50th=[ 5407], 99.90th=[15795], 99.95th=[22414],
     | 99.99th=[24511]
   bw (  KiB/s): min= 2396, max= 2840, per=100.00%, avg=2676.69, stdev=96.58, samples=119
   iops        : min=  599, max=  710, avg=669.13, stdev=24.14, samples=119
  lat (usec)   : 1000=10.60%
  lat (msec)   : 2=80.14%, 4=0.11%, 10=8.99%, 20=0.09%, 50=0.07%
  cpu          : usr=2.12%, sys=5.24%, ctx=40155, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,40105,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=82.7MiB/s (86.8MB/s), 82.7MiB/s-82.7MiB/s (86.8MB/s-86.8MB/s), io=1024MiB (1074MB), run=12375-12375msec

Run status group 1 (all jobs):
  WRITE: bw=74.5MiB/s (78.2MB/s), 74.5MiB/s-74.5MiB/s (78.2MB/s-78.2MB/s), io=1024MiB (1074MB), run=13736-13736msec

Run status group 2 (all jobs):
   READ: bw=81.8MiB/s (85.8MB/s), 81.8MiB/s-81.8MiB/s (85.8MB/s-85.8MB/s), io=1024MiB (1074MB), run=12516-12516msec

Run status group 3 (all jobs):
  WRITE: bw=76.8MiB/s (80.5MB/s), 76.8MiB/s-76.8MiB/s (80.5MB/s-80.5MB/s), io=1024MiB (1074MB), run=13342-13342msec

Run status group 4 (all jobs):
   READ: bw=9789KiB/s (10.0MB/s), 9789KiB/s-9789KiB/s (10.0MB/s-10.0MB/s), io=574MiB (601MB), run=60002-60002msec

Run status group 5 (all jobs):
  WRITE: bw=2848KiB/s (2916kB/s), 2848KiB/s-2848KiB/s (2916kB/s-2916kB/s), io=167MiB (175MB), run=60002-60002msec

Run status group 6 (all jobs):
   READ: bw=5887KiB/s (6029kB/s), 5887KiB/s-5887KiB/s (6029kB/s-6029kB/s), io=345MiB (362MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=2674KiB/s (2738kB/s), 2674KiB/s-2674KiB/s (2738kB/s-2738kB/s), io=157MiB (164MB), run=60001-60001msec

Disk stats (read/write):
  sdb: ios=237431/84741, merge=2/0, ticks=203168/136492, in_queue=339661, util=99.46%